#Дано действительное число Х. Вычислить значения Х в степени 3 и Х в степени 10 за четыре операции умножения.

X = int(input("значение"))
X2=X*X
X3=X2*X
X5=X2*X3
X10=X5*X5
print ("ответ",X3)
print ("oтвет2",X10)