#3.	Вычислить факториал введенного с клавиатуры натурального
# числа. Для решения задачи использовать цикл, функцию
# factorial() использовать нельзя. В программе должно быть
# предусмотрено, что факториал нуля равен единице.


if (x>0):
    p = 1
    while (x>0):
        p = p*x
        x = x-1
    print ("фактор")